tsung-etag.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/home/ec2-user/opt/tsung-1.5.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
	<clients>
    	<client host="localhost" use_controller_vm="true" maxusers='15000'/>
	</clients>

  <!-- Server side setup -->
	<servers>
    	<server host="moneysaved-load-test-yzq.i9d9cwmss2.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  	</servers>

    <load>
    	<arrivalphase phase="1" duration="30" unit="second">
      		<users arrivalrate="1" unit="second"></users>
    	</arrivalphase>
  		<arrivalphase phase="2" duration="30" unit="second">
      		<users arrivalrate="2" unit="second"></users>
    	</arrivalphase>
    	<arrivalphase phase="3" duration="30" unit="second">
      		<users arrivalrate="4" unit="second"></users>
    	</arrivalphase>
    	<arrivalphase phase="4" duration="30" unit="second">
      		<users arrivalrate="8" unit="second"></users>
    	</arrivalphase>
    	<arrivalphase phase="5" duration="30" unit="second">
      		<users arrivalrate="16" unit="second"></users>
    	</arrivalphase>
      <arrivalphase phase="6" duration="30" unit="second">
          <users arrivalrate="32" unit="second"></users>
      </arrivalphase>
  	</load>


  	<options>
    <!-- Set connection timeout to 2 seconds -->
    	<option name="global_ack_timeout" value="2000"></option>

    	<option type="ts_http" name="user_agent">
    		<user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    	</option>
  	</options>

  	<sessions>

      <!-- user-flow-3 -->
    	<session name="user-flow-3" probability="100" type="ts_http">
    		
    		<!-- visit the home page -->
  	     <request>
            <http url="/" version='1.1' method='GET'></http>
  		    </request>
	
			   <thinktime value="2" random="true"></thinktime>

        <setdynvars sourcetype="random_number" start="1" end="10000">
          <var name="rnd_user" />
       </setdynvars>

        <request>
            <dyn_variable name="authenticity_token"></dyn_variable>
            <http url="/login" version='1.1' method='GET'></http>
        </request>

        <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
        <var name="authenticity_token" />
        </setdynvars>

        <request subst="true">
            <http url="/login" 
                  version='1.1' 
                  method='POST' 
                  contents="utf8=%E2%9C%93&amp;authenticity_token=%%_authenticity_token%%&amp;session%5Bemail%5D=test%%_rnd_user%%%40test.com&amp;session%5Bpassword%5D=123456&amp;session%5Bremember_me%5D=0&amp;commit=Log+in" 
                  content_type="application/x-www-form-urlencoded"></http>
        </request>

        <!-- random choose a category -->
        <thinktime value="2" random="true"></thinktime>

			 <setdynvars sourcetype="random_number" start="1" end="5">
  				<var name="rnd_category" />
			 </setdynvars>

			   <request subst="true">
            <dyn_variable name="ETag"></dyn_variable>
        		<http url="/categories/%%_rnd_category%%" version='1.1' method='GET'></http>
    		</request>

    		<!-- view deals and click on a random deal to check the deal detail -->
			 <thinktime value="2" random="true"></thinktime>

			 <setdynvars sourcetype="random_number" start="1" end="100000">
  				<var name="rnd_deal" />
			 </setdynvars>

			 <request subst="true">
            <dyn_variable name="authenticity_token"></dyn_variable>
        		<http url="/deals/%%_rnd_deal%%" version='1.1' method='GET'></http>
    	 </request>

        <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
        <var name="authenticity_token" />
        </setdynvars>

       <!-- like the deal-->
       <request subst="true">
            <http url="/likes" 
                  version='1.1' 
                  method='POST' 
                  contents="utf8=%E2%9C%93&amp;authenticity_token=%%_authenticity_token%%&amp;like%5Bdeal_id%5D=%%_rnd_deal%%&amp;button=" 
                  content_type="application/x-www-form-urlencoded"></http>
        </request>

    		
    		<thinktime value="2" random="true"></thinktime>

        <request subst="true">
            <http url="/categories/%%_rnd_category%%" version='1.1' method='GET'>
              <http_header name="If-None-Match" value="%%_ETag%%"/>
            </http>
        </request>

        <!-- check the ranking page -->
        <thinktime value="2" random="true"></thinktime>
    		<request>
        		<http url="/rank/show" version='1.1' method='GET'></http>
    		</request>

        <thinktime value="2" random="true"></thinktime>

        <request subst="true">
            <http url="/categories/%%_rnd_category%%" version='1.1' method='GET'>
              <http_header name="If-None-Match" value="%%_ETag%%"/>
            </http>
        </request>

	    </session>
      <!-- end -->


  	</sessions>

</tsung>